app/controllers/amrc_reports_controller.rb

SELECT  1 AS one FROM `projects` LIMIT 1
SELECT  `projects`.* FROM `projects` ORDER BY `projects`.`id` ASC LIMIT 1
---
  def get_rex
    if Project.exists?