app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`userID` = 1
---
  def new
    if Project.where(:userID => current_user.id).blank?

SELECT  `projects`.* FROM `projects` WHERE `projects`.`userID` = 5 LIMIT 1
---
  def edit
    @project = Project.find_by userID: current_user.id

INSERT INTO `projects` (`charity_name`, `research_spending`, `financial_year`, `audited_account`, `spending_research_overseas`, `spending_uk_capital_projects`, `spending_overseas_capital_projects`, `spending_brief_of_capital_projects`, `spending_other_non_medical_research_charitable_activities`, `total_charitable_expenditure`, `estimated_spending_on_medical_research`, `use_of_data_approve_graphs`, `use_of_data_share_aggreement`, `approval_name`, `approval_job_title`, `approval_description`, `contact_name`, `contact_email`, `contact_description`, `created_at`, `updated_at`, `userID`) VALUES ('newder', 123.0, '12/12', 1, '5433', '66664', '444', 'frer', '123234', '12344', '23233232', 1, 1, 'grep', 'shrep', 'flep', 'brep', 'nep@crep.brep', 'shrep', '2018-01-03 13:26:59', '2018-01-03 13:26:59', 11)
---
  def create
    @project = Project.new(project_params)
      if @project.save

SELECT  `projects`.* FROM `projects` WHERE `projects`.`userID` = 5 LIMIT 1
UPDATE `projects` SET `financial_year` = '12/12', `updated_at` = '2018-01-06 12:45:24' WHERE `projects`.`id` = 7
---
  def update
    @project = Project.find_by userID: current_user.id
    if @project.update_attributes(project_params)