app/controllers/users_controller.rb

def index
  @users = Array.new()
  User.all.each do |u|
---
SELECT `users`.* FROM `users` WHERE (charity_name LIKE '%%')

def update
@users = User.find(params[:id])

if @users.update_attributes(project_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `submission_status_resexp` = 1, `updated_at` = '2018-01-03 13:32:12' WHERE `users`.`id` = 7

def edit
  @users = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1